released/M031BSP_I2C_NSP2340A/SampleCode/Template/nsp_driver.c
#include "nsp_driver.h"
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"

#define I2C_BUF_SIZE   	520	
UINT8 u8WriteBuffer[I2C_BUF_SIZE];
UINT8 u8ReadBuffer[I2C_BUF_SIZE];
UINT16  u16CMD_TX_BYTE	= 0;
UINT16  u16CMD_RX_BYTE	= 0;
UINT8 	u8RX_ERROR_COUNT=0;			

// #define NSP_TIMER				(TIMER0)
#define NSP_I2C_ADDR			(0x5A)		// customize in NSP playlist editor tool , when interface set as I2C

extern void I2C0_Init(void);
extern char i2c_reg_write(unsigned char i2c_addr, unsigned int reg_addr, unsigned char *reg_data, unsigned int length);
extern char i2c_reg_read(unsigned char i2c_addr, unsigned int reg_addr, unsigned char *reg_data, unsigned int length);
//===========================================================

//Systerm intial, please modify according to your MCU platform
void HOST_SYS_Init(void)
{		
}

//Systerm intial, please modify according to your MCU platform
void HOST_BUS_Init(void)
{
	// �O���_��I2C,�O���l�� and Slave address.
	I2C0_Init();
}

//Systerm intial, please modify according to your MCU platform
UINT16 N_I2C_READ(UINT16 READ_SIZE)
{
	// �O���xȡI2C�Y��, u8ReadBuffer Ϊ����FIFO���ݵĻ�����,u16CMD_RX_BYTE Ϊ��ȡ���ֽ�����
	i2c_reg_read(NSP_I2C_ADDR,0x00, (unsigned char *) &u8ReadBuffer[0] , u16CMD_RX_BYTE);
	return READ_SIZE;
}

//Systerm intial, please modify according to your MCU platform
UINT16 N_I2C_WRITE(UINT16 WRITE_SIZE)
{
	// �趨����I2C����,u8WriteBuffer Ϊ�����������ݷ��͵�FIFO����,u16CMD_TX_BYTE Ϊд����ֽ���
	i2c_reg_write(NSP_I2C_ADDR,0x00, (unsigned char *) &u8WriteBuffer[0], u16CMD_TX_BYTE);
	return WRITE_SIZE;
}
//----------------------------------
//Systerm intial, please modify according to your MCU platform, during which you can perform other operations on host
void HOST_I2C_WRITE_DURATION(void)
{
//����I2Cд�ӳ�ʱ��;  Delay time
	// TIMER_Delay( NSP_TIMER, 1000);
	CLK_SysTickDelay(1000);
}
//Systerm intial, please modify according to your MCU platform, during which you can perform other operations on host
void HOST_I2C_READ_DURATION(void)
{
//����I2C���ӳ�ʱ��;  Delay time
	// TIMER_Delay( NSP_TIMER, 1000);	
	CLK_SysTickDelay(1000);
}
//Systerm intial, please modify according to your MCU platform, during which you can perform other operations on host
void HOST_CMD_INTERVAL(void)
{
//�����ӳ�ʱ��2ms;  Delay time 2ms
	// TIMER_Delay( NSP_TIMER, 2000);
	CLK_SysTickDelay(2000);
}
//Systerm intial, please modify according to your MCU platform, during which you can perform other operations on host
void HOST_Delay500uS(void)
{
//�����ӳ�ʱ��500us;  Delay time 500us
	// TIMER_Delay( NSP_TIMER, 500);
	CLK_SysTickDelay(500);
}
//===========================================================
void HOST_Init(UINT8* SP_VOL)
{
	*SP_VOL = 0x80;	
}
//------------------------------------------------
UINT8 CHECK_I2C_READ_RIGHT()
{
	UINT16 i = 0;
	UINT8 CMD_CHECKSUM = 0;
	
	if (u16CMD_RX_BYTE == 1)
	{
		if (u8ReadBuffer[0] == RIGHT_RTN)
		{
			u8RX_ERROR_COUNT = 0;
			return 1;
		}
		if (u8ReadBuffer[0] == ERROR_RTN)
		{
			u8RX_ERROR_COUNT ++;
			return 0;
		}	
		if (u8ReadBuffer[0] == UNSUPPORTED_RTN)
		{
			u8RX_ERROR_COUNT = 0;
			return 0xFF;
		}
	}
	else
	{
		for(i = 0; i < (u16CMD_RX_BYTE-1); i++)
		{
			CMD_CHECKSUM += u8ReadBuffer[i];
		}
		if ((CMD_CHECKSUM ^ u8ReadBuffer[u16CMD_RX_BYTE-1]) == 0xFF)
		{
			u8RX_ERROR_COUNT = 0;
			return 1;
		}
		else
		{
			u8RX_ERROR_COUNT ++;
			return 0;
		}
	}	
	return 0;
}
//------------------------------------------------
void ADD_I2C_WRITE_CHECKSUM(UINT8 u8CMDBytes,UINT16 u16BufferBytes,UINT8 *DATA_BUFFER)
{	
	UINT16 i = 0;
	UINT8 CMD_CHECKSUM = 0;
	for(i = 0; i < u8CMDBytes; i++)
	{
		CMD_CHECKSUM = ((CMD_CHECKSUM + u8WriteBuffer[i]) & 0xFF);
	}
	for(i = 0; i < u16BufferBytes; i++)
	{
		u8WriteBuffer[u8CMDBytes+i] = *DATA_BUFFER;
		CMD_CHECKSUM = ((CMD_CHECKSUM + u8WriteBuffer[u8CMDBytes+i]) & 0xFF);
		DATA_BUFFER++;
	}
	u8WriteBuffer[u16CMD_TX_BYTE-1] = (CMD_CHECKSUM ^ 0xFF );
}
//------------------------------------------------
void ADD_I2C_WRITE_CHECKSUM_2B(UINT8 u8CMDBytes,UINT16 u16BufferBytes,UINT16 *DATA_BUFFER)
{	
	UINT16 i = 0;
	UINT8 CMD_CHECKSUM = 0;
	for(i = 0; i < u8CMDBytes; i++)
	{
		CMD_CHECKSUM = ((CMD_CHECKSUM + u8WriteBuffer[i]) & 0xFF);
	}
	for(i = 0; i < u16BufferBytes; i++)
	{
		u8WriteBuffer[u8CMDBytes+2*i] = (*DATA_BUFFER  & 0xFF00)>>8;
		CMD_CHECKSUM = ((CMD_CHECKSUM + u8WriteBuffer[u8CMDBytes+2*i]) & 0xFF);
		u8WriteBuffer[u8CMDBytes+2*i+1] = (*DATA_BUFFER  & 0xFF);
		CMD_CHECKSUM = ((CMD_CHECKSUM + u8WriteBuffer[u8CMDBytes+2*i+1]) & 0xFF);
		DATA_BUFFER++;
	}
	u8WriteBuffer[u16CMD_TX_BYTE-1] = (CMD_CHECKSUM ^ 0xFF );
}
//----------------------------------
void N_SLAVE_RESET(void)
{
	if(u8RX_ERROR_COUNT >=5) 
	{
		u8RX_ERROR_COUNT = 0;
		N_RESET();	
	}
}
//===========================================================
// function command
UINT8 N_READ_ID(UINT32* PID)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_READ_ID;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_READ_ID_TX_BYTE;
	u16CMD_RX_BYTE = CMD_READ_ID_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	if (RTN == 1)
	{
		 *PID = (u8ReadBuffer[0]<<24) | (u8ReadBuffer[1]<<16) | (u8ReadBuffer[2]<<8) | u8ReadBuffer[3];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_READ_STATUS(UINT8* COMMAND_STATUS)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_READ_STATUS;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_READ_STATUS_TX_BYTE;
	u16CMD_RX_BYTE = CMD_READ_STATUS_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	if (RTN == 1)
	{
		*COMMAND_STATUS = u8ReadBuffer[0];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_DO_LVD(void)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_DO_LVD;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_DO_LVD_TX_BYTE;
	u16CMD_RX_BYTE = CMD_DO_LVD_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_GET_LVD(UINT8* LVD_STATUS)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_GET_LVD;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_GET_LVD_TX_BYTE;
	u16CMD_RX_BYTE = CMD_GET_LVD_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
