released/M031BSP_I2C_NSP2340A/SampleCode/Template/nsp_driver.c
	if (RTN == 1)
	{
		*LVD_STATUS = u8ReadBuffer[0];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_CHECKSUM_RIGHT(UINT8* CHECKSUM_BIT)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_CHECKSUM_RIGHT;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_CHECKSUM_RIGHT_TX_BYTE;
	u16CMD_RX_BYTE = CMD_CHECKSUM_RIGHT_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	if (RTN == 1)
	{
		*CHECKSUM_BIT = u8ReadBuffer[0];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_GET_CHECKSUM(UINT16* CHECKSUM_BYTES)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_GET_CHECKSUM;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_GET_CHECKSUM_TX_BYTE;
	u16CMD_RX_BYTE = CMD_GET_CHECKSUM_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	if (RTN == 1)
	{
		*CHECKSUM_BYTES = (u8ReadBuffer[0]<<8) | u8ReadBuffer[1];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_DO_CHECKSUM(void)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_DO_CHECKSUM;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_DO_CHECKSUM_TX_BYTE;
	u16CMD_RX_BYTE = CMD_DO_CHECKSUM_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_GET_FW_VERSION(UINT32* PFW_VERSION)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_GET_FW_VERSION;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_GET_FW_VERSION_TX_BYTE;
	u16CMD_RX_BYTE = CMD_GET_FW_VERSION_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	if (RTN == 1)
	{
		 *PFW_VERSION = (u8ReadBuffer[0]<<16) | (u8ReadBuffer[1]<<8) | u8ReadBuffer[2];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_PLAY_REPEAT(UINT8 REPEAT_COUNT)
{
	UINT8 RTN = 0;
	
	u8WriteBuffer[0] = CMD_REPEAT;
	u8WriteBuffer[1] = REPEAT_COUNT;
	u8WriteBuffer[2] = ((u8WriteBuffer[0] + u8WriteBuffer[1]) & 0xFF) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_REPEAT_TX_BYTE;
	u16CMD_RX_BYTE = CMD_REPEAT_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_STOP_REPEAT()
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_STOP_REPEAT;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_STOP_REPEAT_TX_BYTE;
	u16CMD_RX_BYTE = CMD_STOP_REPEAT_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_PLAY(UINT16 PlayListIndex)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_PLAY;
	u8WriteBuffer[1] = PlayListIndex >>8;
	u8WriteBuffer[2] = PlayListIndex & 0xFF;
	u8WriteBuffer[3] = ((u8WriteBuffer[0] + u8WriteBuffer[1]+ u8WriteBuffer[2])& 0xFF)^ 0xFF;
	u16CMD_TX_BYTE = CMD_PLAY_TX_BYTE;
	u16CMD_RX_BYTE = CMD_PLAY_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	HOST_CMD_INTERVAL();
	
	HOST_Delay500uS();
	HOST_Delay500uS();
	HOST_Delay500uS();
	return RTN;
}
//----------------------------------
UINT8 N_PLAY_CHANNEL(UINT8 ChannelMsk, UINT16* PlayIndexArry)
{
	UINT8 RTN = 0, u8Count = 0, u8Checksum = 0;
	u8WriteBuffer[0] = CMD_PLAY_CHANNEL;
	u8WriteBuffer[1] = ChannelMsk;
	u8Checksum += u8WriteBuffer[0];
	u8Checksum += u8WriteBuffer[1];
	if( ChannelMsk&BIT0 )
	{
		u8WriteBuffer[2] = PlayIndexArry[0] >>8;
		u8Checksum += u8WriteBuffer[2];
		u8WriteBuffer[3] = PlayIndexArry[0] & 0xFF;	
		u8Checksum += u8WriteBuffer[3];
		u8Count = 1;
	}
	if( ChannelMsk&BIT1 )
	{
		u8WriteBuffer[2+u8Count*2] = PlayIndexArry[u8Count] >>8;
		u8Checksum += u8WriteBuffer[2+u8Count*2];
		u8WriteBuffer[2+u8Count*2+1] = PlayIndexArry[u8Count] & 0xFF;	
		u8Checksum += u8WriteBuffer[2+u8Count*2+1];
		u8Count += 1;
	}	
	u8WriteBuffer[2+u8Count*2] = u8Checksum ^ 0xff;

	u16CMD_TX_BYTE = CMD_PLAY_CHANNEL_TX_BYTE + u8Count*2;
	u16CMD_RX_BYTE = CMD_PLAY_CHANNEL_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	HOST_CMD_INTERVAL();
	
	HOST_Delay500uS();
	HOST_Delay500uS();
	HOST_Delay500uS();
	
	return RTN;	
}
//----------------------------------
UINT8 N_PLAY_SLEEP(UINT16 PlayListIndex)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_PLAY_SLEEP;
	u8WriteBuffer[1] = PlayListIndex >>8;
	u8WriteBuffer[2] = PlayListIndex & 0xFF;
	u8WriteBuffer[3] = ((u8WriteBuffer[0] + u8WriteBuffer[1]+ u8WriteBuffer[2])& 0xFF)^ 0xFF;
	u16CMD_TX_BYTE = CMD_PLAY_SLEEP_TX_BYTE;
	u16CMD_RX_BYTE = CMD_PLAY_SLEEP_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	HOST_CMD_INTERVAL();
	
	HOST_Delay500uS();
	HOST_Delay500uS();
	HOST_Delay500uS();
	return RTN;
}
//----------------------------------
UINT8 N_IO_CONFIG(UINT8 IO_FLAG)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_IO_CONFIG;
	u8WriteBuffer[1] = IO_FLAG;
	u8WriteBuffer[2] = ((u8WriteBuffer[0] + u8WriteBuffer[1]) & 0xFF) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_IO_CONFIG_TX_BYTE;
	u16CMD_RX_BYTE = CMD_IO_CONFIG_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_IO_TYPE(UINT8* READ_IO_FLAG)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_IO_TYPE;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_IO_TYPE_TX_BYTE;
	u16CMD_RX_BYTE = CMD_IO_TYPE_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
