released/M031BSP_I2C_NSP2340A/SampleCode/Template/nsp_driver.c
	if (RTN == 1)
	{
		*READ_IO_FLAG = u8ReadBuffer[0];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_SET_OUT(UINT8 IO_VALUE)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_SET_OUT;
	u8WriteBuffer[1] = IO_VALUE;
	u8WriteBuffer[2] = ((u8WriteBuffer[0] + u8WriteBuffer[1]) & 0xFF) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_SET_OUT_TX_BYTE;
	u16CMD_RX_BYTE = CMD_SET_OUT_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_GET_INOUT(UINT8* READ_IO_VALUE)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_GET_INOUT;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_GET_INOUT_TX_BYTE;
	u16CMD_RX_BYTE = CMD_GET_INOUT_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	if (RTN == 1)
	{
		*READ_IO_VALUE = u8ReadBuffer[0];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_BZPIN_EN()
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_BZPIN_EN;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_BZPIN_EN_TX_BYTE;
	u16CMD_RX_BYTE = CMD_BZPIN_EN_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_BZPIN_DIS()
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_BZPIN_DIS;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_BZPIN_DIS_TX_BYTE;
	u16CMD_RX_BYTE = CMD_BZPIN_DIS_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_SET_VOL(UINT8 SP_VOL)
{
	UINT8 RTN = 0;
	
	u8WriteBuffer[0] = CMD_SET_VOL_NSP;
	u8WriteBuffer[1] = SP_VOL;
	u8WriteBuffer[2] = ((u8WriteBuffer[0] + u8WriteBuffer[1]) & 0xFF) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_SET_VOL_TX_BYTE;
	u16CMD_RX_BYTE = CMD_SET_VOL_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_GET_VOL(UINT8* SP_VOL)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_GET_VOL;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_GET_VOL_TX_BYTE;
	u16CMD_RX_BYTE = CMD_GET_VOL_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	if (RTN == 1)
	{
		*SP_VOL = u8ReadBuffer[0];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
//After the host sends STOP cmd,
//it will send READ_STATUS cmd every interval (HOST_CMD_INTERVAL), 
//and the loop will execute until the READ_STATUS cmd gets the correct result, 
//so as to ensure that the NSP STOP operation has been completed.
UINT8 N_STOP()
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;
	
	u8WriteBuffer[0] = CMD_STOP;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_STOP_TX_BYTE;
	u16CMD_RX_BYTE = CMD_STOP_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	while ((N_READ_STATUS(&u8NSP_STATUS1) != 1) || (u8NSP_STATUS1 != CMD_VALID))
	{
		HOST_Delay500uS();
		HOST_Delay500uS();
	}
	return RTN;
}

//----------------------------------
UINT8 N_STOP_CHANNEL(UINT8 ChannelMsk)
{
	UINT8 RTN = 0;

	u8WriteBuffer[0] = CMD_STOP_CHANNEL;
	u8WriteBuffer[1] = ChannelMsk;
	u8WriteBuffer[2] = ((u8WriteBuffer[0] + u8WriteBuffer[1]) & 0xFF) ^ 0xFF;
	u16CMD_TX_BYTE = CMD_STOP_CHANNEL_TX_BYTE;
	u16CMD_RX_BYTE = CMD_STOP_CHANNEL_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	HOST_CMD_INTERVAL();
	
	HOST_Delay500uS();
	HOST_Delay500uS();
	HOST_Delay500uS();
	
	return RTN;
}
//----------------------------------
//After the host sends RESET cmd,
//it will send READ_STATUS cmd every interval (HOST_CMD_INTERVAL), 
//and the loop will execute until the READ_STATUS cmd gets the correct result, 
//so as to ensure that the NSP stop operation has been completed.
UINT8 N_RESET()
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;
	
	u8WriteBuffer[0] = CMD_RESET;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_RESET_TX_BYTE;
	u16CMD_RX_BYTE = CMD_RESET_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	while ((N_READ_STATUS(&u8NSP_STATUS1) != 1) || (u8NSP_STATUS1 != CMD_VALID))
	{
		HOST_Delay500uS();
		HOST_Delay500uS();
	}
	return RTN;
}
//----------------------------------
UINT8 N_PWR_DOWN()
{
	UINT8 RTN = 0;
	UINT8 n = 0;
	
	u8WriteBuffer[0] = CMD_PWR_DOWN;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_PWR_DOWN_TX_BYTE;
	u16CMD_RX_BYTE = CMD_PWR_DOWN_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	HOST_CMD_INTERVAL();
	
	for (n= 0; n <= 40; n++)
	{
		HOST_Delay500uS();
	}
	return RTN;
}
//----------------------------------
UINT8 N_ISP_CHECKSUM(UINT16* ISP_CHECKSUM_BYTES)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_ISP_CHECKSUM;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_ISP_CHECKSUM_TX_BYTE;
	u16CMD_RX_BYTE = CMD_ISP_CHECKSUM_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	if (RTN == 1)
	{
		*ISP_CHECKSUM_BYTES = (u8ReadBuffer[0]<<8) | u8ReadBuffer[1];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_ISP_WRITE_START(UINT32 PROC_ID,UINT32 CHIP_PDID)
{
	UINT8 RTN = 0;
	UINT8 i = 0;
	UINT8 u8NSP_STATUS1 = 0;
	
	u8WriteBuffer[0] = CMD_ISP_WRITE_START;
	u8WriteBuffer[1] = (PROC_ID & 0xff000000) >> 24;
	u8WriteBuffer[2] = (PROC_ID & 0x00ff0000) >> 16;
	u8WriteBuffer[3] = (CHIP_PDID & 0xff000000) >> 24;
	u8WriteBuffer[4] = (CHIP_PDID & 0xff0000) >> 16;
	u8WriteBuffer[5] = (CHIP_PDID & 0xff00) >> 8;
	u8WriteBuffer[6] = (CHIP_PDID & 0xff) ;
	u8WriteBuffer[7] = 0;
	for(i = 0; i <(CMD_ISP_WRITE_START_TX_BYTE-1); i++)
		{
			u8WriteBuffer[7] = ((u8WriteBuffer[7] + u8WriteBuffer[i]) & 0xFF);
		}
	u8WriteBuffer[7] = (u8WriteBuffer[7] ^ 0xff);
	u16CMD_TX_BYTE = CMD_ISP_WRITE_START_TX_BYTE;
	u16CMD_RX_BYTE = CMD_ISP_WRITE_START_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	while ((N_READ_STATUS(&u8NSP_STATUS1) != 1) || (u8NSP_STATUS1 != CMD_VALID))
	{
		HOST_CMD_INTERVAL();
	}
	return RTN;
}
//----------------------------------
UINT8 N_ISP_WRITE_END(void)
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;
	
	u8WriteBuffer[0] = CMD_ISP_WRITE_END;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_ISP_WRITE_END_TX_BYTE;
	u16CMD_RX_BYTE = CMD_ISP_WRITE_END_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	while ((N_READ_STATUS(&u8NSP_STATUS1) != 1) || (u8NSP_STATUS1 != CMD_VALID))
	{
		HOST_CMD_INTERVAL();
	}
	return RTN;
}
//----------------------------------
UINT8 N_ISP_WRITE_PAGE(UINT32 ISP_ADDR,PUINT8 ISP_BUFFER)
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;
	
	
	u8WriteBuffer[0] = CMD_ISP_WRITE_PAGE;
	u8WriteBuffer[1] = (ISP_ADDR & 0xFF0000)>>16;
	u8WriteBuffer[2] = (ISP_ADDR & 0xFF00)>>8;
	u8WriteBuffer[3] = (ISP_ADDR & 0xFF);
	u16CMD_TX_BYTE = CMD_ISP_WRITE_PAGE_TX_BYTE;
	u16CMD_RX_BYTE = CMD_ISP_WRITE_PAGE_RX_BYTE;
	
	ADD_I2C_WRITE_CHECKSUM(4, 0x200 ,ISP_BUFFER);
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	HOST_CMD_INTERVAL();
	HOST_CMD_INTERVAL();
	HOST_CMD_INTERVAL();
	HOST_CMD_INTERVAL();
	while ((N_READ_STATUS(&u8NSP_STATUS1) != 1) || (u8NSP_STATUS1 != CMD_VALID))
	{
		HOST_CMD_INTERVAL();
		HOST_CMD_INTERVAL();
		HOST_CMD_INTERVAL();
		HOST_CMD_INTERVAL();
		HOST_CMD_INTERVAL();
	}
	return RTN;
}
//----------------------------------
UINT8 N_ISP_READ_PAGE(UINT32 ISP_ADDR,PUINT8 ISP_BUFFER)
{
	UINT8 RTN = 0;
	
