released/M031BSP_I2C_NSP2340A/SampleCode/Template/nsp_driver.c
	u8WriteBuffer[0] = CMD_ISP_READ_PAGE;
	u8WriteBuffer[1] = (ISP_ADDR & 0xFF0000)>>16;
	u8WriteBuffer[2] = (ISP_ADDR & 0xFF00)>>8;
	u8WriteBuffer[3] = (ISP_ADDR & 0xFF);
	u8WriteBuffer[4] = ((u8WriteBuffer[0] + u8WriteBuffer[1]+ u8WriteBuffer[2]+ u8WriteBuffer[3])& 0xFF)^ 0xFF;
	u16CMD_TX_BYTE = CMD_ISP_READ_PAGE_TX_BYTE;
	u16CMD_RX_BYTE = CMD_ISP_READ_PAGE_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_ISP_READ_PARTIAL(UINT32 ISP_ADDR,UINT16 ISPSize,PUINT8 ISP_BUFFER)
{
	UINT8 RTN = 0;
	UINT8 i = 0;
	
	u8WriteBuffer[0] = CMD_ISP_READ_PARTIAL;
	u8WriteBuffer[1] = (ISP_ADDR & 0xFF0000)>>16;
	u8WriteBuffer[2] = (ISP_ADDR & 0xFF00)>>8;
	u8WriteBuffer[3] = (ISP_ADDR & 0xFF);
	u8WriteBuffer[4] = (ISPSize & 0xFF00)>>8;
	u8WriteBuffer[5] = (ISPSize & 0xFF);
	u8WriteBuffer[6] = 0;
	for(i = 0; i <(CMD_ISP_READ_PARTIAL_TX_BYTE-1); i++)
		{
			u8WriteBuffer[6] = u8WriteBuffer[6] + u8WriteBuffer[i];
		}
	u8WriteBuffer[6] = (u8WriteBuffer[6] ^ 0xff);
	u16CMD_TX_BYTE = CMD_ISP_READ_PARTIAL_TX_BYTE;
	u16CMD_RX_BYTE = CMD_ISP_READ_PARTIAL_RX_BYTE + ISPSize;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_ISP_READ_RES_INDEX(UINT16 ResourceIndex)
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;
	u8WriteBuffer[0] = CMD_ISP_READ_RES_INDEX;
	u8WriteBuffer[1] = ResourceIndex >>8;
	u8WriteBuffer[2] = ResourceIndex & 0xFF;
	u8WriteBuffer[3] = ((u8WriteBuffer[0] + u8WriteBuffer[1]+ u8WriteBuffer[2])& 0xFF)^ 0xFF;
	u16CMD_TX_BYTE = CMD_ISP_READ_RES_INDEX_TX_BYTE;
	u16CMD_RX_BYTE = CMD_ISP_READ_RES_INDEX_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	while ((N_READ_STATUS(&u8NSP_STATUS1) != 1) || (u8NSP_STATUS1 != CMD_VALID))
	{
		HOST_CMD_INTERVAL();
	}
	return RTN;
}
//----------------------------------
UINT8 N_ISP_GET_RES_INFO(UINT32* SpaceSize,UINT32* ResourceStartAddr,UINT16* FisrtPageDataByte,UINT16* PageCount,UINT16* LastPageDataByte)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_ISP_GET_RES_INFO;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_ISP_GET_RES_INFO_TX_BYTE;
	u16CMD_RX_BYTE = CMD_ISP_GET_RES_INFO_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	if (RTN == 1)
	{
		 *SpaceSize             = (u8ReadBuffer[0]<<16) | (u8ReadBuffer[1]<<8) | u8ReadBuffer[2];
		 *ResourceStartAddr     = (u8ReadBuffer[3]<<16) | (u8ReadBuffer[4]<<8) | u8ReadBuffer[5];
		 *FisrtPageDataByte     = (u8ReadBuffer[6]<<8) | u8ReadBuffer[7];
		 *PageCount              = (u8ReadBuffer[8]<<8) | u8ReadBuffer[9];
		 *LastPageDataByte      = (u8ReadBuffer[10]<<8) | u8ReadBuffer[11];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_ISP_GET_USER_SPACE_INFO(UINT32* SpaceSize,UINT32* ResourceStartAddr,UINT16* FisrtPageDataByte,UINT16* PageCount,UINT16* LastPageDataByte)
{
	UINT8 RTN = 0;
	u8WriteBuffer[0] = CMD_ISP_GET_USER_SPACE_INFO;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_ISP_GET_USER_SPACE_INFO_TX_BYTE;
	u16CMD_RX_BYTE = CMD_ISP_GET_USER_SPACE_INFO_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	if (RTN == 1)
	{
		 *SpaceSize             = (u8ReadBuffer[0]<<16) | (u8ReadBuffer[1]<<8) | u8ReadBuffer[2];
		 *ResourceStartAddr     = (u8ReadBuffer[3]<<16) | (u8ReadBuffer[4]<<8) | u8ReadBuffer[5];
		 *FisrtPageDataByte     = (u8ReadBuffer[6]<<8) | u8ReadBuffer[7];
		 *PageCount              = (u8ReadBuffer[8]<<8) | u8ReadBuffer[9];
		 *LastPageDataByte      = (u8ReadBuffer[10]<<8) | u8ReadBuffer[11];
	}
	HOST_CMD_INTERVAL();
	return RTN;
}
//----------------------------------
UINT8 N_ISP_WRITE_PARTIAL_START(void)
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;
	
	u8WriteBuffer[0] = CMD_ISP_WRITE_PARTIAL_START;
	u8WriteBuffer[1] = u8WriteBuffer[0] ^ 0xFF;
	u16CMD_TX_BYTE = CMD_ISP_WRITE_PARTIAL_START_TX_BYTE;
	u16CMD_RX_BYTE = CMD_ISP_WRITE_PARTIAL_START_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	while ((N_READ_STATUS(&u8NSP_STATUS1) != 1) || (u8NSP_STATUS1 != CMD_VALID))
	{
		HOST_CMD_INTERVAL();
	}
	return RTN;
}
//----------------------------------
UINT8 N_ISP_WRITE_PARTIAL_BAK(UINT32 ISP_ADDR)
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;	
	
	u8WriteBuffer[0] = CMD_ISP_WRITE_PARTIAL_BAK;
	u8WriteBuffer[1] = (ISP_ADDR & 0xFF0000)>>16;
	u8WriteBuffer[2] = (ISP_ADDR & 0xFF00)>>8;
	u8WriteBuffer[3] = (ISP_ADDR & 0xFF);
	u8WriteBuffer[4] = ((u8WriteBuffer[0] + u8WriteBuffer[1]+ u8WriteBuffer[2]+ u8WriteBuffer[3])& 0xFF)^ 0xFF;
	u16CMD_TX_BYTE = CMD_ISP_WRITE_PARTIAL_BAK_TX_BYTE;
	u16CMD_RX_BYTE = CMD_ISP_WRITE_PARTIAL_BAK_RX_BYTE;
	
	N_I2C_WRITE(u16CMD_TX_BYTE);
	HOST_I2C_WRITE_DURATION();
	N_I2C_READ(u16CMD_RX_BYTE);
	HOST_I2C_READ_DURATION();
	RTN = CHECK_I2C_READ_RIGHT();
	
	HOST_CMD_INTERVAL();
	HOST_CMD_INTERVAL();
	HOST_CMD_INTERVAL();
	HOST_CMD_INTERVAL();
	HOST_CMD_INTERVAL();
	while ((N_READ_STATUS(&u8NSP_STATUS1) != 1) || (u8NSP_STATUS1 != CMD_VALID))
	{
		HOST_CMD_INTERVAL();
		HOST_CMD_INTERVAL();
		HOST_CMD_INTERVAL();
		HOST_CMD_INTERVAL();
		HOST_CMD_INTERVAL();
	}
	return RTN;
}
//----------------------------------
UINT8 N_ISP_WRITE_PARTIAL(UINT32 ISP_ADDR,UINT16 ISPSize,PUINT8 ISP_BUFFER)
{
	UINT8 RTN = 0;
	UINT8 u8NSP_STATUS1 = 0;
	
	u8WriteBuffer[0] = CMD_ISP_WRITE_PARTIAL;
	u8WriteBuffer[1] = (ISP_ADDR & 0xFF0000)>>16;
	u8WriteBuffer[2] = (ISP_ADDR & 0xFF00)>>8;
	u8WriteBuffer[3] = (ISP_ADDR & 0xFF);
	u8WriteBuffer[4] = (ISPSize & 0xFF00)>>8;
	u8WriteBuffer[5] = (ISPSize & 0xFF);
	u16CMD_TX_BYTE = CMD_ISP_WRITE_PARTIAL_TX_BYTE + ISPSize ;
	u16CMD_RX_BYTE = CMD_ISP_WRITE_PARTIAL_RX_BYTE;
	
